ruuvi/ruuvi.drivers.c/src/nrf5_sdk15_platform/communication/ruuvi_nrf5_sdk15_communication_ble_gatt.c
        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();

            if (err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK (err_code);
            }
        }
        break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            RD_ERROR_CHECK (ruuvi_nrf5_sdk15_to_ruuvi_error (
                                          p_evt->params.peer_data_update_failed.error), RD_SUCCESS);
        }
        break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            RD_ERROR_CHECK (ruuvi_nrf5_sdk15_to_ruuvi_error (
                                          p_evt->params.peer_delete_failed.error), RD_SUCCESS);
        }
        break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            RD_ERROR_CHECK (ruuvi_nrf5_sdk15_to_ruuvi_error (
                                          p_evt->params.peers_delete_failed_evt.error), RD_SUCCESS);
        }
        break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            RD_ERROR_CHECK (ruuvi_nrf5_sdk15_to_ruuvi_error (
                                          p_evt->params.error_unexpected.error), RD_SUCCESS);
        }
        break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}



/**
 * @brief Function for the Peer Manager initialization.
 */
static ret_code_t peer_manager_init()
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code = NRF_SUCCESS;
    err_code |= pm_init();

    // Failed because storage cannot be initialized.
    if (NRF_SUCCESS != err_code)
    {
        ri_flash_purge();
        ri_power_reset();
    }

    memset (&sec_param, 0, sizeof (ble_gap_sec_params_t));
    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;
    err_code = pm_sec_params_set (&sec_param);

    if (NRF_SUCCESS != err_code) { }

    err_code = pm_register (pm_evt_handler);

    if (NRF_SUCCESS != err_code) { }

    return err_code;
}

rd_status_t ri_gatt_init (void)
{
    ret_code_t err_code = NRF_SUCCESS;
    rd_status_t radio_status = RD_SUCCESS;

    if (m_gatt_is_init)
    {
        return RD_ERROR_INVALID_STATE;
    }

    if (!ri_radio_is_init())
    {
        return RD_ERROR_INVALID_STATE;
    }

    // Connection param module requires timers
    if (!ri_timer_is_init())
    {
        LOGW("NRF5 SDK15 BLE4 GATT module requires initialized timers\r\n");
        return RD_ERROR_INVALID_STATE;
    }

    nrf_ble_qwr_init_t qwr_init = {0};
    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER (m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
    err_code |= peer_manager_init();
    err_code |= gap_params_init();
    err_code |= nrf_ble_gatt_init (&m_gatt, gatt_evt_handler);
    err_code |= nrf_ble_gatt_att_mtu_periph_set (&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;
    err_code |= nrf_ble_qwr_init (&m_qwr, &qwr_init);
    err_code |= conn_params_init();

    if (NRF_SUCCESS == err_code)
    {
        m_gatt_is_init = true;
    }

    return ruuvi_nrf5_sdk15_to_ruuvi_error (err_code);
}

/**
 *
 */
static rd_status_t ri_gatt_nus_uninit (ri_comm_channel_t * const _channel)
{
    if (NULL == _channel) { return RD_ERROR_NULL; }

    memset (_channel, 0, sizeof (ri_comm_channel_t));
    m_gatt_is_init = false;

    // disconnect
    if (BLE_CONN_HANDLE_INVALID != m_conn_handle)
    {
        sd_ble_gap_disconnect (m_conn_handle, HCI_ERROR_CODE_CONN_TERM_BY_LOCAL_HOST);
    }

    // Services cannot be uninitialized
    return RD_SUCCESS;
}

/**
 *
 */
static rd_status_t ri_gatt_nus_send (ri_comm_message_t * const message)
{
    if (NULL == message) { return RD_ERROR_NULL; }

    if (BLE_NUS_MAX_DATA_LEN < message->data_length) { return RD_ERROR_DATA_SIZE; }

    if (BLE_CONN_HANDLE_INVALID == m_conn_handle) { return RD_ERROR_INVALID_STATE; }

    if (message->repeat_count)
    {
        return RD_ERROR_NOT_IMPLEMENTED;
    }

    ret_code_t err_code = NRF_SUCCESS;
    uint16_t data_len = message->data_length;
    err_code |= ble_nus_data_send (&m_nus, message->data, &data_len, m_conn_handle);
    return ruuvi_nrf5_sdk15_to_ruuvi_error (err_code);
}

static rd_status_t ri_gatt_nus_read (ri_comm_message_t * const message)
{
    return RD_ERROR_NOT_SUPPORTED;
}

rd_status_t ri_gatt_nus_init (ri_comm_channel_t * const _channel)
{
    if (NULL == _channel) { return RD_ERROR_NULL; }

    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    // Initialize NUS.
    memset (&nus_init, 0, sizeof (nus_init));
    nus_init.data_handler = nus_data_handler;
    err_code = ble_nus_init (&m_nus, &nus_init);
    channel = _channel;
    channel->init   = ri_gatt_nus_init;
    channel->uninit = ri_gatt_nus_uninit;
    channel->send   = ri_gatt_nus_send;
    channel->read   = ri_gatt_nus_read;
    m_gatt_is_init = true;
    return ruuvi_nrf5_sdk15_to_ruuvi_error (err_code);
}

bool ble_nus_is_connected (void)
{
    ret_code_t err_code = NRF_SUCCESS;
    ble_nus_client_context_t * p_client;
    err_code = blcm_link_ctx_get (m_nus.p_link_ctx_storage, m_conn_handle,
                                  (void *) &p_client);

    if (NRF_SUCCESS != err_code)
    {
        return false;
    }

    if ( (m_conn_handle == BLE_CONN_HANDLE_INVALID) || (p_client == NULL))
    {
        return false;
    }

    if (!p_client->is_notification_enabled)
    {
        return false;
    }

