ruuvi/ruuvi.drivers.c/src/nrf5_sdk15_platform/communication/ruuvi_nrf5_sdk15_communication_ble_gatt.c
    return true;
}

rd_status_t ri_gatt_dfu_init (void)
{
    ret_code_t err_code = NRF_SUCCESS;
    ble_dfu_buttonless_init_t dfus_init = {0};
    // Initialize the async SVCI interface to bootloader.
    err_code = ble_dfu_buttonless_async_svci_init();

    if (NRF_SUCCESS != err_code) {}

    dfus_init.evt_handler = ble_dfu_evt_handler;
    err_code = ble_dfu_buttonless_init (&dfus_init);

    if (NRF_SUCCESS != err_code) {}

    return ruuvi_nrf5_sdk15_to_ruuvi_error (err_code);
}

/**
 * @brief Initialize BLE Device Information Service
 *
 * @param[in] dis pointer to data which should be presented over DIS. Memory will be deep-copied
 */
rd_status_t ri_gatt_dis_init (const ri_comm_dis_init_t * const p_dis)
{
    if (NULL == p_dis) { return RD_ERROR_NULL; }

    ret_code_t err_code = NRF_SUCCESS;
    ble_dis_init_t dis_init;
    ri_comm_dis_init_t dis_local;
    memset (&dis_init, 0, sizeof (dis_init));
    memcpy (&dis_local, p_dis, sizeof (dis_local));
    ble_srv_ascii_to_utf8 (&dis_init.manufact_name_str, dis_local.manufacturer);
    ble_srv_ascii_to_utf8 (&dis_init.model_num_str, dis_local.model);
    ble_srv_ascii_to_utf8 (&dis_init.serial_num_str, dis_local.deviceid);
    ble_srv_ascii_to_utf8 (&dis_init.hw_rev_str, dis_local.hw_version);
    ble_srv_ascii_to_utf8 (&dis_init.fw_rev_str, dis_local.fw_version);
    // Read security level 1, mode 1. OPEN, i.e. anyone can read without encryption.
    // Write not allowed.
    dis_init.dis_char_rd_sec = SEC_OPEN;
    err_code = ble_dis_init (&dis_init);
    return ruuvi_nrf5_sdk15_to_ruuvi_error (err_code);
}

#endif